
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// формируем движения регистра ОстаткиТоваров
	Движения.ОстаткиТоваров.Очистить();
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = ТекСтрокаТабличнаяЧасть.Товар;
		Движение.Количество = ТекСтрокаТабличнаяЧасть.Количество;
	КонецЦикла;

	// формируем движения регистра ВазиморасчетыСКонтрагентом
	Движения.ВазиморасчетыСКонтрагентом.Очистить();
	Движения.ВазиморасчетыСКонтрагентом.Записывать = Истина;
	Движение = Движения.ВазиморасчетыСКонтрагентом.Добавить();	
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;		
	Движение.Сумма = ТабличнаяЧасть.Итог("Сумма");
	
	// запись движений	
	Движения.ВазиморасчетыСКонтрагентом.Записать();		
	Движения.ОстаткиТоваров.Записать();	

				
КонецПроцедуры
