
&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	
	//ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени("Обработка Выполнение запроса");
	//	
	//		
	//ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремени("Обработка Выполнение запроса",
	//"Описание КО", Запрос.Текст);
	ВыполнитьЗапросСервер();
КонецПроцедуры

Процедура ВыполнитьЗапросСервер()
	
		Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 3000000
	|	РС_Тест1.Число1,
	|	РС_Тест1СрезПоследних.Число1 КАК Число11
	|ИЗ
	|	РегистрСведений.РС_Тест1.СрезПоследних КАК РС_Тест1СрезПоследних,
	|	РегистрСведений.РС_Тест1 КАК РС_Тест1";
	
	Запрос.Выполнить();

	
КонецПроцедуры
