
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РегистрБухгалтерии1 Дебет
	Движения.РегистрБухгалтерии1.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
		Движение = Движения.РегистрБухгалтерии1.Добавить();
		Движение.ВидДвижения = ВидДвиженияБухгалтерии.Дебет;
		Движение.Счет = ПланыСчетов.ПланСчетов1.Товары;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТабличнаяЧасть.Товар;
		Движение.Количество = ТекСтрокаТабличнаяЧасть.Количество;
	КонецЦикла;

	// регистр РегистрБухгалтерии1 Кредит
	Движения.РегистрБухгалтерии1.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
		Движение = Движения.РегистрБухгалтерии1.Добавить();
		Движение.ВидДвижения = ВидДвиженияБухгалтерии.Кредит;
		Движение.Счет = ПланыСчетов.ПланСчетов1.Касса;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТабличнаяЧасть.Товар;
		Движение.Количество = ТекСтрокаТабличнаяЧасть.Количество;
	КонецЦикла;
	
	Движения.Записать();

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
