
Процедура ОбработкаПроведения(Отказ, Режим)
	Сообщить("Я поменял тут");
	// запрос остатков		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажаТабличнаяЧасть.Товар,
	|	СУММА(ПродажаТабличнаяЧасть.Количество) КАК Количество,
	|	СУММА(ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток
	|ИЗ
	|	Документ.Продажа.ТабличнаяЧасть КАК ПродажаТабличнаяЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(, Склад = &Склад) КАК ОстаткиТоваровОстатки
	|		ПО ПродажаТабличнаяЧасть.Товар = ОстаткиТоваровОстатки.Товар
	|ГДЕ
	|	ПродажаТабличнаяЧасть.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажаТабличнаяЧасть.Товар
	|
	|";
	
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	// при выполнении запроса в транзакции накладывается S блокировка
	Результат = Запрос.Выполнить();
	// в управляемом режиме - снимается сразу после выполненя запроса
	// в автоматическом - держится до конца транзакции (до окончания проведения)
		
	// проверка на наличие отрицательных остатков
	ВыборкаДетальныеЗаписи = Результат.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 		
		Если (ВыборкаДетальныеЗаписи.КоличествоОстаток - ВыборкаДетальныеЗаписи.Количество < 0) Тогда
			Сообщить("Недостаточно товара " + ВыборкаДетальныеЗаписи.Товар);
			Отказ = Истина;
		КонецЕсли;		
	КонецЦикла;
	
	// формируем движения регистра ОстаткиТоваров
	Движения.ОстаткиТоваров.Очистить();
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть2 Из ТабличнаяЧасть Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = ТекСтрокаТабличнаяЧасть2.Товар;
		Движение.Количество = ТекСтрокаТабличнаяЧасть2.Количество;
	КонецЦикла;
	
	// формируем движения регистра ВазиморасчетыСКонтрагентом
	Движения.ВазиморасчетыСКонтрагентом.Очистить();
	Движения.ВазиморасчетыСКонтрагентом.Записывать = Истина;
	Движение = Движения.ВазиморасчетыСКонтрагентом.Добавить();	
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;		
	Движение.Сумма = ТабличнаяЧасть.Итог("Сумма");
	
	// запись движений, здесь накладывается X блокировка
	Движения.ОстаткиТоваров.Записать();
	Если (Константы.ПаузаПриПроведении.Получить()) Тогда
		// пауза сделана намеренно
		КипВнешнийКомпонент.Пауза(КипВнешнийКомпонент.ПолучитьИнструменты(), 5000); 
	КонецЕсли;  

	Движения.ВазиморасчетыСКонтрагентом.Записать();	
	
	//////////////////////////////////////////////////////
		
	
КонецПроцедуры
