Процедура ОбновитьЦенуТовара(ТаблицаТоваров, ИндексНачала, РазмерПроции) Экспорт	
	
	// обновляем цену только для определенной части таблицы
	Для Сч = 1 По РазмерПроции Цикл
		Индекс = ?(Сч=1, ИндексНачала, Индекс+1);
		
		ТоварОбъект = ТаблицаТоваров[Индекс].Ссылка.ПолучитьОбъект();
		ТоварОбъект.Цена = ТоварОбъект.Цена + 1;
		ТоварОбъект.Записать();
	КонецЦикла;
	
	// пауза что бы успеть показать список фоновых заданий в консоли
	КипВнешнийКомпонент.Пауза(КипВнешнийКомпонент.ПолучитьИнструменты(), 10000);
	
КонецПроцедуры

Процедура ПодпискаНаСобытие1ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры
