
Функция getNom(Name)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Код,
		|	Номенклатура.Наименование,
		|	Номенклатура.ВидНоменклатуры.Наименование КАК ВидНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	(&ПустоеНаименование
		|			ИЛИ Номенклатура.Наименование = &Наименование)";
	
	Запрос.УстановитьПараметр("Наименование", Name);
	Запрос.УстановитьПараметр("ПустоеНаименование", Не ЗначениеЗаполнено(Name));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТипСписокНоменклатуры = ФабрикаXDTO.Тип("http://www.rusl.ru.Nomemclature","СписокНоменклатуры");
	ТипСтрокаНоменклатуры = ФабрикаXDTO.Тип("http://www.rusl.ru.Nomemclature","СтрокаНоменклатуры");
	ТипНоменклатура = ФабрикаXDTO.Тип("http://www.rusl.ru.Nomemclature","Nomenclature");
	
	СписокНоменклатуры = ФабрикаXDTO.Создать(ТипСписокНоменклатуры,);
	Номер = 1;	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Номенклатура = ФабрикаXDTO.Создать(ТипНоменклатура);
		Номенклатура.Наименование = ВыборкаДетальныеЗаписи.Наименование;
		Номенклатура.Код = ВыборкаДетальныеЗаписи.Код;
		Номенклатура.ВидНоменклатуры = ВыборкаДетальныеЗаписи.ВидНоменклатуры;
		СтрокаНоменклатуры = ФабрикаXDTO.Создать(ТипСтрокаНоменклатуры);
		СтрокаНоменклатуры.Номенулатура = Номенклатура;
		СтрокаНоменклатуры.Номер = Номер;
		СтрокаНоменклатуры.Количество = 1;
		СтрокаНоменклатуры.Цена = 1000;
		СтрокаНоменклатуры.Сумма = 1000;
		
		Номер = Номер + 1;
		
		СписокНоменклатуры.Добавить(СтрокаНоменклатуры,"http://www.rusl.ru.Nomemclature","СтрокаНоменклатуры");
		
	КонецЦикла;
	
	Возврат СписокНоменклатуры;
			
КонецФункции
